aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
/*******************************************************************************
  Ethernet Driver Library Definition

  Company:
    Microchip Technology Inc.
    
  FIle Name:
    drv_etchmac_lib.h

  Summary:
    This file contains the Application Program Interface (API) definition  for
    the Ethernet Driver library.

  Description:
    This library provides a low-level abstraction of the Ethernet module
    on Microchip PIC32MX family microcontrollers with a convenient C language
    interface.  It can be used to simplify low-level access to the module
    without the necessity of interacting directly with the module's registers,
    thus hiding differences from one microcontroller variant to another.
*******************************************************************************/
//DOM-IGNORE-BEGIN
/*****************************************************************************
 Copyright (C) 2008-2018 Microchip Technology Inc. and its subsidiaries.

Microchip Technology Inc. and its subsidiaries.

Subject to your compliance with these terms, you may use Microchip software 
and any derivatives exclusively with Microchip products. It is your 
responsibility to comply with third party license terms applicable to your 
use of third party software (including open source software) that may 
accompany Microchip software.

THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A PARTICULAR 
PURPOSE.

IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE 
FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN 
ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY, 
THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
*****************************************************************************/

//DOM-IGNORE-END


#ifndef _DRV_ETHMAC_LIB_H_
#define _DRV_ETHMAC_LIB_H_

#include <stdlib.h>
#include <sys/kmem.h>
#include <xc.h>

#include "system_config.h"
#include "system/debug/sys_debug.h"
#include "system/command/sys_command.h"
#include "system/time/sys_time.h"
#include "system/sys_time_h2_adapter.h"

#include "tcpip/tcpip_ethernet.h"
#include "driver/ethmac/src/dynamic/_eth_dcpt_lists.h"
#include "driver/ethmac/src/dynamic/drv_eth_pic32_lib.h"
#include "driver/ethmac/src/drv_ethmac_local.h"


// *****************************************************************************
// *****************************************************************************
// Section: Constants & Data Types
// *****************************************************************************
// *****************************************************************************



/**************************************************************************
  Summary:
    Defines the possible results of Ethernet operations that can succeed or
    fail
  Description:
    Ethernet Operation Result Codes
    
    This enumeration defines the possible results of any of the Ethernet
    library operations that have the possibility of failing. This result
    should be checked to ensure that the operation achieved the desired
    result.                                                                
**************************************************************************/

typedef enum
{
    /* Everything ok */
    DRV_ETHMAC_RES_OK                     /*DOM-IGNORE-BEGIN*/ =  0 /*DOM-IGNORE-END*/,

    /* Ethernet RX, TX, acknowledge packet codes */

    /* No such packet exist */
    DRV_ETHMAC_RES_NO_PACKET,

    /* Packet is queued (not transmitted or received and not processed) */
    DRV_ETHMAC_RES_PACKET_QUEUED,

    /* Not enough descriptors available */
    DRV_ETHMAC_RES_NO_DESCRIPTORS,
    
    /* Errors: Ethernet buffers, descriptors */

    /* Some memory allocation failed */
    DRV_ETHMAC_RES_OUT_OF_MEMORY          /*DOM-IGNORE-BEGIN*/ =  -1 /*DOM-IGNORE-END*/,

    /* We don't support user space buffers. */
    DRV_ETHMAC_RES_USPACE_ERR             /*DOM-IGNORE-BEGIN*/ =  -2 /*DOM-IGNORE-END*/,

    /* The size of the receive buffers too small */
    DRV_ETHMAC_RES_RX_SIZE_ERR            /*DOM-IGNORE-BEGIN*/ =  -3 /*DOM-IGNORE-END*/,

    /* A received packet spans more buffers/descriptors than supplied */
    DRV_ETHMAC_RES_RX_PKT_SPLIT_ERR       /*DOM-IGNORE-BEGIN*/ =  -4 /*DOM-IGNORE-END*/,

} DRV_ETHMAC_RESULT; 






// Section: Descriptors and Buffers Functions
// *****************************************************************************
/* Ethernet Descriptor Allocation Function Pointer

  Function:
    void* <FunctionName> ( size_t nitems, size_t size, void* param )

  Summary:
    Pointer to a function that allocates the requested memory and returns a
    pointer to it.

  Description:
    Pointer to a function that allocates enough memory for "nitems" each of
    "size" bytes in length (total memory requested is nitems*size).
    The allocated space should be initialized to zero.

  Precondition:
    None

  Parameters:
    nitems      - number of items to be allocated
    size        - size of each item, in bytes
    param       - extra parameter that will be used by the function call

  Returns:
    On success  - A pointer to the requested space.
    On failure  = A null pointer.

  Remarks:
    This function will be invoked for allocation of descriptors only.
    Therefore, the size parameter will be the one returned by
    DRV_ETHMAC_LibDescriptorsGetSize(DRV_ETHMAC_INSTANCE_DCPT* pMacD);
*/

typedef void* ( *DRV_ETHMAC_DCPT_AllocF )( size_t nitems, size_t size, void* param );


// *****************************************************************************
/* Ethernet Descriptor Free Function

  Function:
    void <FunctionName> ( void* ptr, void* param )

  Summary:
    Pointer to a function that deallocates the memory previously allocated by a
    DRV_ETHMAC_DCPT_AllocF function.

  Description:
    Pointer to a function that deallocates the memory previously allocated by a
    DRV_ETHMAC_DCPT_AllocF function.

  Precondition:
    The DRV_ETHMAC_DCPT_AllocF would have been previously called.

  Parameters:
    ptr         - Points to the space that was previously allocated with a
                  DRV_ETHMAC_DCPT_AllocF function.
    param       - extra parameter that will be used by the function call

  Returns:
    None.

