aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
  Remarks:
    None.
*/

typedef void ( *DRV_ETHMAC_DCPT_FreeF ) ( void* ptr, void* param );


// *****************************************************************************
/* Ethernet Descriptor Types

  Summary:
    Enumeration defining the Ethernet descriptor types.

  Description:
    This enumeration defines the Ethernet descriptor types.

  Remarks:
    Most descriptor operations support just one type, but multiple flags can be
    set.
*/

typedef enum
{
    // TX descriptor
    DRV_ETHMAC_DCPT_TYPE_RX    /*DOM-IGNORE-BEGIN*/ = 0x1 /*DOM-IGNORE-END*/,

    // RX descriptor
    DRV_ETHMAC_DCPT_TYPE_TX    /*DOM-IGNORE-BEGIN*/ = 0x2 /*DOM-IGNORE-END*/,

    // All (both) types.  Some descriptor operations support multiple types.
    DRV_ETHMAC_DCPT_TYPE_ALL   /*DOM-IGNORE-BEGIN*/ = (DRV_ETHMAC_DCPT_TYPE_RX|DRV_ETHMAC_DCPT_TYPE_TX) /*DOM-IGNORE-END*/

} DRV_ETHMAC_DCPT_TYPE;      // descriptor types


// *****************************************************************************
/*  Buffer Flags

  Summary:
    Flags for buffer attributes.

  Description:
    Some buffers can have special attributes, as defined by this enumeration.
*/

typedef enum
{
    // The receive buffer is sticky, going to be used across multiple RX
    // operations once it's acknowledged
    DRV_ETHMAC_BUFF_FLAG_RX_STICKY /*DOM-IGNORE-BEGIN*/ = 0x1 /*DOM-IGNORE-END*/,

    // The receive descriptor associated to this buffer should not be
    // automatically acknowledged when DRV_ETHMAC_LibRxAcknowledgeBuffer/DRV_ETHMAC_LibRxAcknowledgePacket
    // is called.
    // User is responsible for specifically calling DRV_ETHMAC_LibAckRxDcpt(DRV_ETHMAC_INSTANCE_DCPT* pMacD) to acknowledge
    // the RX descriptor
    DRV_ETHMAC_BUFF_FLAG_RX_UNACK /*DOM-IGNORE-BEGIN*/ = 0x2 /*DOM-IGNORE-END*/,

} DRV_ETHMAC_BUFF_FLAGS;



// *****************************************************************************
/* Ethernet Close Flags

  Summary:
    Defines the possible disable codes of Ethernet controller "DRV_ETHMAC_LibClose" call.

  Description:
    This enumeration defines the close capabilities of the Ethernet module.
*/

typedef enum
{
    /* Wait for the current TX/RX operation to finish */
    DRV_ETHMAC_CLOSE_GRACEFUL  /*DOM-IGNORE-BEGIN*/ = 0x1 /*DOM-IGNORE-END*/,

    // Default close options
    DRV_ETHMAC_CLOSE_DEFAULT /*DOM-IGNORE-BEGIN*/ = 0 /*DOM-IGNORE-END*/,

} DRV_ETHMAC_CLOSE_FLAGS; 




// *****************************************************************************
// *****************************************************************************
// Section: Ethernet Peripheral Library Interface Routines
// *****************************************************************************
// *****************************************************************************

// Section:  Open and Configuration Functions

/*******************************************************************************
  Function:
      void DRV_ETHMAC_LibInit (DRV_ETHMAC_INSTANCE_DCPT* pMacD)

  Summary:
    Ethernet initialization routine
  Description:
    This function performs the initialization of the Ethernet Controller.

  Precondition:
    None.

  Parameters:
    index -  Identifier for the device instance.

  Returns:
    None
  Example:
    <code>
    DRV_ETHMAC_LibInit(DRV_ETHMAC_INSTANCE_DCPT* pMacD);
    </code>
  Remarks:
    This function should be called before the DRV_ETHMAC_LibMACOpen()
    routine.

    Replaces:

    <b><c>void EthInit(void)</c></b>
  ************************************************************************/

void DRV_ETHMAC_LibInit (DRV_ETHMAC_INSTANCE_DCPT* pMacD);


/*******************************************************************************
  Function:
    void DRV_ETHMAC_LibMACOpen(DRV_ETHMAC_INSTANCE_DCPT* pMacD, TCPIP_ETH_OPEN_FLAGS oFlags, TCPIP_ETH_PAUSE_TYPE pauseType )

  Summary:
    Initializes and configures the Ethernet MAC.

  Description:
    This function performs the open and configuration of the Ethernet MAC.  It needs
    to be called after the DRV_ETHMAC_LibInit(DRV_ETHMAC_INSTANCE_DCPT* pMacD) was called and the PHY initialized.


  Precondition:
    DRV_ETHMAC_LibInit must have been called.

  Parameters:
    pMacD       - driver instance.
    oFlags      - Open flags
    pauseType   - Pause type to be supported by the MAC


  Returns:
    Ethernet operation result code.

  Example:
    <code>
    // Enable loopback at the MAC level
    oFlags    = TCPIP_ETH_OPEN_FDUPLEX|TCPIP_ETH_OPEN_100|TCPIP_ETH_OPEN_HUGE_PKTS|TCPIP_ETH_OPEN_MAC_LOOPBACK;
    // Use both TX and RX pause type for Full Duplex
    pauseType = TCPIP_MAC_PAUSE_ALL;

    // Start the initialization sequence
    DRV_ETHMAC_LibInit(DRV_ETHMAC_INSTANCE_DCPT* pMacD);

    // Open and configure the MAC.
    //
    // Since we're not connected to an external PHY there's no negotiation
    // going on and we know all our opening flags
    DRV_ETHMAC_LibMACOpen(DRV_ETHMAC_INSTANCE_DCPT* pMacD, oFlags, pauseType);
    </code>

  Remarks:
    If no auto-negotiation is performed, the DRV_ETHMAC_LibMACOpen() could be called
    immediately after DRV_ETHMAC_LibInit(DRV_ETHMAC_INSTANCE_DCPT* pMacD) and PHY initialization.  Otherwise the open
    flags and the pause type should be the ones obtained as a result of the
    PHY negotiation procedure!
    <p>Replaces:<p><c><b>void EthMACOpen(TCPIP_ETH_OPEN_FLAGS oFlags, TCPIP_ETH_PAUSE_TYPE pauseType)</b></c>
 *****************************************************************************/

void DRV_ETHMAC_LibMACOpen (DRV_ETHMAC_INSTANCE_DCPT* pMacD, TCPIP_ETH_OPEN_FLAGS oFlags, TCPIP_ETH_PAUSE_TYPE pauseType );


/*******************************************************************************
  Function:
    void DRV_ETHMAC_LibClose(DRV_ETHMAC_INSTANCE_DCPT* pMacD, DRV_ETHMAC_CLOSE_FLAGS cFlags )

  Summary:
    Aborts any transactions and disables the Ethernet controller

  Description:
    This function performs an abort of any current Ethernet transactions, disables
    the Ethernet controller and interrupts.  It should be called after the PHY
    close/reset procedure.

  Precondition:
    None.

  Parameters:
    pMacD       - driver instance.
    cFlags - closing flags

  Returns:
    None.

  Example:
    <code>
    DRV_ETHMAC_LibClose(DRV_ETHMAC_INSTANCE_DCPT* pMacD, DRV_ETHMAC_CLOSE_DEFAULT);
    </code>

