aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
  Remarks:
    It does not free any allocated memory.
    <p>Replaces:<p><c><b>void EthClose(DRV_ETHMAC_CLOSE_FLAGS cFlags)</b></c>
 *****************************************************************************/

void DRV_ETHMAC_LibClose (DRV_ETHMAC_INSTANCE_DCPT* pMacD, DRV_ETHMAC_CLOSE_FLAGS cFlags );


// *****************************************************************************
// *****************************************************************************
// Section: Descriptors add and remove functions
// *****************************************************************************
// *****************************************************************************

/*******************************************************************************
  Function:
    int DRV_ETHMAC_LibDescriptorsPoolAdd (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  int nDescriptors, DRV_ETHMAC_DCPT_TYPE dType,
                                              DRV_ETHMAC_DCPT_AllocF fAlloc, void* fParam )

  Summary:
    Adds transmit & receive descriptors to the pool.

  Description:
    This function adds the specified number of transmit/receive descriptors to
    the pool of descriptors.  These descriptors are used whenever a new
    transmission or a reception is initiated.  The needed memory per descriptor
    is returned by DRV_ETHMAC_LibDescriptorsGetSize.   Descriptors can be freed with
    DRV_ETHMAC_LibDescriptorsPoolRemove.

  Precondition:
    DRV_ETHMAC_LibInit should have been called.

  Parameters:
    pMacD           - driver instance.
    nDescriptors    - Number of descriptors to be added

    dType           - TX/RX descriptors requested

    fAlloc          - Function to be called to allocate the needed memory

    fParam          - parameter to be used when fAlloc is called

  Returns:
    The number of descriptors successfully created.

  Example:
    <code>
    if( DRV_ETHMAC_LibDescriptorsPoolAdd(DRV_ETHMAC_INSTANCE_DCPT* pMacD, txDcptNo, DRV_ETHMAC_DCPT_TYPE_TX, fMemAlloc, &myInstanceData) != txDcptNo )
    {
        // Handle allocation error
    }
    </code>

  Remarks:
    The number of created descriptors is different from the number of
    requested ones only if the memory allocation failed.

    The first time the specific pool is initialized an extra descriptor is added to the pool
    so that the actual memory requested will be (nDescriptors+1)*EthDescriptorsGetSize().

    fAlloc should not be NULL.

    The complete clean-up is done by DRV_ETHMAC_LibDescriptorsPoolCleanUp();

    DRV_ETHMAC_DCPT_TYPE_ALL use is invalid. A proper descriptor type (RX or TX) has
    to be used.
    <p>Replaces:<p><c><b>int EthDescriptorsPoolAdd ( int nDescriptors, DRV_ETHMAC_DCPT_TYPE dType, DRV_ETHMAC_DCPT_AllocF fAlloc, void* fParam )</b></c>
 *****************************************************************************/

int DRV_ETHMAC_LibDescriptorsPoolAdd (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  int nDescriptors, DRV_ETHMAC_DCPT_TYPE dType, DRV_ETHMAC_DCPT_AllocF fAlloc, void* fParam );


/*******************************************************************************
  Function:
    int DRV_ETHMAC_LibDescriptorsPoolRemove (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  int nDescriptors, DRV_ETHMAC_DCPT_TYPE dType,
                               DRV_ETHMAC_DCPT_FreeF fFree, void* fParam )

  Summary:
    Tries to remove the specified number of descriptors from the pool.

  Description:
    This function tries to remove the specified number of descriptors from the
    pool of transmit/receive descriptors.  These descriptors that are NOT used
    at the time of call can be freed (i.e. the TX descriptors not queued for a
    transmission or the not busy RX descriptors).

  Precondition:
    DRV_ETHMAC_LibInit should have been called.

  Parameters:
    pMacD           - driver instance.
    nDescriptors    - Number of descriptors to be removed
    dType           - TX/RX descriptors requested
    fFree           - Function to release the the memory
    fParam          - parameter to be used when fFree is called


  Returns:
    The number of descriptors removed.

  Example:
    <code>
    if ( DRV_ETHMAC_LibDescriptorsPoolRemove(pMacD, txDcptNo, DRV_ETHMAC_DCPT_TYPE_TX, ffree, 0) != txDcptNo)
    {
        // Handle de-allocation error.
    }
    </code>

  Remarks:
    If fFree is NULL then the descriptors are removed from the specified pool but no de-allocation
    function is called.
    The allocation/deallocation memory functions should be consistent.

    The complete clean-up is done by DRV_ETHMAC_LibDescriptorsPoolCleanUp.

    DRV_ETHMAC_DCPT_TYPE_ALL use is invalid. A proper descriptor type (RX or TX) has
    to be used.
    <p>Replaces:<p><c><b>int EthDescriptorsPoolRemove ( int nDescriptors, DRV_ETHMAC_DCPT_TYPE dType, DRV_ETHMAC_DCPT_FreeF fFree, void* fParam )</b></c>
 *****************************************************************************/

int DRV_ETHMAC_LibDescriptorsPoolRemove (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  int nDescriptors, DRV_ETHMAC_DCPT_TYPE dType, DRV_ETHMAC_DCPT_FreeF fFree, void* fParam );


/*******************************************************************************
  Function:
    void DRV_ETHMAC_LibDescriptorsPoolCleanUp (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  DRV_ETHMAC_DCPT_TYPE dType, DRV_ETHMAC_DCPT_FreeF fFree, void* fParam )

  Summary:
    Removes all the specified descriptors from the pool.

  Description:
    This function performs descriptors clean-up and removes all the specified
    descriptors from the pool of transmit/receive descriptors.

  Precondition:
    DRV_ETHMAC_LibClose should have been called.

  Parameters:
    pMacD        - driver instance.
    dType        - TX/RX/All descriptors requested
    fFree        - Function to release the the memory
    fParam       - parameter to be used when fFree is called

  Returns:
    None.

  Example:
    <code>
    DRV_ETHMAC_LibDescriptorsPoolCleanUp(DRV_ETHMAC_INSTANCE_DCPT* pMacD, DRV_ETHMAC_DCPT_TYPE_ALL, fFree, &myInstanceData);
    </code>

