aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
  Remarks:
    If fFree is NULL then the descriptors are removed from the pools but no de-allocation
    function is called.
    The allocation/deallocation memory functions should be consistent.

    It does not free the memory allocated for the application supplied "sticky"
    buffers.  It is the calling application responsibility.

    DRV_ETHMAC_LibClose should have been called or no TX/RX activity should be enabled at
    the time this function is called.

    If DRV_ETHMAC_DCPT_TYPE_ALL is supplied the function will perform the clean-up of
    both types of descriptors.
    <p>Replaces:<p><c><b>void EthDescriptorsPoolCleanUp ( DRV_ETHMAC_DCPT_TYPE dType, DRV_ETHMAC_DCPT_FreeF fFree, void* fParam )</b></c>
 *****************************************************************************/

void DRV_ETHMAC_LibDescriptorsPoolCleanUp (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  DRV_ETHMAC_DCPT_TYPE dType, DRV_ETHMAC_DCPT_FreeF fFree, void* fParam );


/*******************************************************************************
  Function:
      void* DRV_ETHMAC_LibDescriptorGetBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  void *pDcpt )

  Summary:
    Returns the associated descriptor buffer.

  Description:
    This function returns the buffer currently associated with the specified descriptor.

  Precondition:

  Parameters:
    pMacD       - driver instance.
    pDcpt -  Pointer to a Ethernet Descriptor


  Returns:
    The address of the buffer associated with this descriptor or NULL if no such descriptor/buffer
    exists.

  Example:
    <code>

    DRV_ETHMAC_LibDescriptorsPoolRemove (pMacD,  1, DRV_ETHMAC_DCPT_TYPE_RX, myRxFreeFnc, 0 );

    void myRxFreeFnc( void* ptr, void* param)
    {
        void* pBuff = DRV_ETHMAC_LibDescriptorGetBuffer(pMacD, ptr);
        if(pBuff)
        {
            // De-allocate the associated buffer
        }
    }
    </code>
  Remarks:
    The function is a helper that returns the buffer associated with a descriptor.
    It can be used to perform the queued RX/TX buffers clean-up since this list is
    maintained by the Ethernet library anyway.

    The pointer for a descriptor is returned by one of the
    DRV_ETHMAC_LibDescriptorsPoolRemove() or DRV_ETHMAC_LibDescriptorsPoolCleanUp() calls as the
    first parameter of the fFree function.

    No protection against interrupts, multithreading, etc.
    <p>Replaces:<p><c><b>void* EthDescriptorGetBuffer ( void *pDcpt )</b></c>
 *****************************************************************************/

void*  DRV_ETHMAC_LibDescriptorGetBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  void *pDcpt );


// *****************************************************************************
// *****************************************************************************
// Section: buffers added for the RX process 
// *****************************************************************************
// *****************************************************************************

/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxBuffersAppend (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  void *ppBuff[], int nBuffs, DRV_ETHMAC_BUFF_FLAGS rxFlags )

  Summary:
    Supplies buffers to the receiving process and enables the receiving part of
    the controller.

  Description:
    This function supplies buffers to the receiving process and enables the
    receiving part of the controller.  As soon as the controller starts
    receiving data packets these will be stored into memory at the addresses
    specified by these buffers.  A received packet can consist of multiple
    buffers, split across buffers with the SAME size, as specified in the
    DRV_ETHMAC_LibRxSetBufferSize.  Each buffer needs an associated receive
    descriptor. Therefore, the number of needed receive descriptors should be
    available for this function to succeed.  Once a receive operation is
    scheduled, DRV_ETHMAC_LibRxGetPacket(DRV_ETHMAC_INSTANCE_DCPT* pMacD, ) can be called to get the received packet.

  Precondition:
    DRV_ETHMAC_LibInit, DRV_ETHMAC_LibDescriptorsPoolAdd, DRV_ETHMAC_LibRxSetBufferSize should have been called.
    Each buffer supplied should be >= DRV_ETHMAC_LibRxSetBufferSize(DRV_ETHMAC_INSTANCE_DCPT* pMacD, ).

  Parameters:
    pMacD       - driver instance.
    ppBuff      - Pointer to an array of buffers (could be NULL terminated) to
                  be appended to the receiving process

    nBuffs      - Number of buffers supplied (or 0 if ppBuff is NULL
                  terminated)

    rxFlags     - Flags applied to all RX buffers passed

  Returns:
    DRV_ETHMAC_RES_OK              - success

    DRV_ETHMAC_RES_NO_DESCRIPTORS  - no enough RX descriptors

    DRV_ETHMAC_RES_USPACE_ERR      - buffers in user space not supported


  Example:
    <code>
    ethRes = DRV_ETHMAC_LibRxBuffersAppend(DRV_ETHMAC_INSTANCE_DCPT* pMacD, rxBuffers, rxDcptNo, DRV_ETHMAC_BUFF_FLAG_RX_STICKY);
    if ( ethRes != DRV_ETHMAC_RES_OK )
    {
        // Handle error
    }
    </code>

  Remarks:
    Not multithreaded safe. Don't call from from both ISR -non ISR code or
    multiple ISR's!

    This function enables the Ethernet receiving.

    When a packet is split into multiple buffers, all buffers have the same
    size, set by the DRV_ETHMAC_LibRxSetBufferSize(DRV_ETHMAC_INSTANCE_DCPT* pMacD, ).

    The append process continues until a NULL buffer pointer is retrieved or
    nBuffs buffers are appended.

    Only RX DRV_ETHMAC_BUFF_FLAGS are relevant for this function.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthRxBuffersAppend ( void *ppBuff[], int nBuffs, DRV_ETHMAC_BUFF_FLAGS rxFlags )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxBuffersAppend (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  void *ppBuff[], int nBuffs, DRV_ETHMAC_BUFF_FLAGS rxFlags );


// Section:  TX/RX Functions
// *****************************************************************************
/* Ethernet Buffer Acknowledge Callback Function

  Function:
    void <Function Name> ( void *pPktBuff, int buffIx, void* param )

  Summary:
    Pointer to an function called to acknowledge a buffer/packet.

  Description:
    Pointer to a function called to acknowledge the completion of a buffer/packet.

  Precondition:
    A TX or RX packet must have been queued.

  Parameters:
    pPktBuff    - Pointer to the currently acknowledged transmitted or received
                  buffer.

    buffIx      - The 0-based buffer index for a packet that spans multiple
                  buffers.

    param       - extra parameter that will be used by the function call


  Returns:
    None.

