aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
  Remarks:
    This function is meant to be used for both RX and TX packets acknowledge.
    It allows the caller to pass an extra parameter that will be used in the
    function call.
*/

typedef void ( *DRV_ETHMAC_BUFF_AckF ) ( void *pPktBuff, int buffIx, void* param );


/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxSendBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, unsigned short int nBytes )

  Summary:
    Schedules the supplied buffer for transmission

  Description:
    This function schedules the supplied buffer for transmission.  To transmit
    this buffer an associated transmit descriptor is needed.  Therefore, a
    transmit descriptor should be available for this function to succeed.  Once
    a transmission is scheduled and done, DRV_ETHMAC_LibTxGetBufferStatus can be called to
    check the transmission result.

  Precondition:
    DRV_ETHMAC_LibMACOpen, DRV_ETHMAC_LibDescriptorsPoolAdd should have been called.
    Valid buffer pointer required.
    Buffers specified should be > 0 and < 2048 bytes in size.

  Parameters:
    pMacD       - driver instance.
    pBuff       - Adress of buffer to be sent

    nBytes      - Size of the buffer in bytes

  Returns:
    DRV_ETHMAC_RES_OK              - success

    DRV_ETHMAC_RES_NO_DESCRIPTORS  - no descriptors available

    DRV_ETHMAC_RES_USPACE_ERR      - user space buffers not supported

  Example:
    <code>
    DRV_ETHMAC_LibTxSendBuffer(pMacD, txBuffer, pktSize);
    </code>

  Remarks:
    Not multithreaded safe.  Don't call from from both ISR and non ISR code
    or multiple ISR's!

    This function enables the Ethernet transmission.

    This function is for transmission of packets completely assembled in one
    buffer.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthTxSendBuffer ( const void *pBuff, unsigned short int nBytes )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxSendBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, unsigned short int nBytes );


/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxSendPacket (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const DRV_ETHMAC_PKT_DCPT *pPkt )

  Summary:
    Schedules the supplied packet for transmission.

  Description:
    This function schedules the supplied packet for transmission.  Each packet
    can consist of multiple buffers, each having a different size, as specified
    in the packet descriptor.  Each buffer will need an associated transmit
    descriptor. Therefore, the number of needed transmit descriptors should be
    available for this function to succeed.  Once a transmission is scheduled
    and done, DRV_ETHMAC_LibTxGetPacketStatus can be called to check the transmission
    result.

  Precondition:
    DRV_ETHMAC_LibMACOpen, DRV_ETHMAC_LibDescriptorsPoolAdd should have been called.
    Valid packet descriptor pointer required.
    Buffers specified should be >0 and < 2048 bytes in size.

  Parameters:
    pMacD       - driver instance.
    pPkt        - Packet descriptor consisting of a list of buffer descriptors,
                  terminated by a NULL pointer.

  Returns:
    DRV_ETHMAC_RES_OK              - success

    DRV_ETHMAC_RES_NO_DESCRIPTORS  - no descriptors available

    DRV_ETHMAC_RES_USPACE_ERR      - user space buffers not supported

  Example:
    <code>
    ethRes = DRV_ETHMAC_LibTxSendPacket(pMacD, &txDcpt);
    if ( ethRes != DRV_ETHMAC_RES_OK )
    {
        // Transmission failed
    }
    </code>

  Remarks:
    Not multithreaded safe. Don't call from from both ISR and non-ISR code or
    multiple ISR's!

    This function enables the Ethernet transmission.

    The packet construction from buffers stops when a descriptor with NULL buffer
    or 0 size is retrieved or the list ends.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthTxSendPacket ( const DRV_ETHMAC_PKT_DCPT *pPkt )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxSendPacket (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const DRV_ETHMAC_PKT_DCPT *pPkt );


/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxGetBufferStatus (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, const DRV_ETHMAC_PKT_STAT_TX **pTxStat )

  Summary:
    Provides the status of a transmitted buffer/packet.

  Description:
    This function provides the status of a transmitted buffer/packet.  The
    transmission of this packet has to have been completed otherwise the call
    will fail.

  Precondition:
    DRV_ETHMAC_LibTxSendBuffer/DRV_ETHMAC_LibTxSendPacket should have been called and the pBuff pointer must be valid.

  Parameters:
    pMacD       - driver instance.
    pBuff       - Buffer part of the packet whose status is being queried.

    pTxStat     - Address to store the pointer to the packet status or NULL if
                  status not needed

  Returns:
    DRV_ETHMAC_RES_OK              - the packet was transmitted OK,

    DRV_ETHMAC_RES_PACKET_QUEUED   - the packet is not done yet

    DRV_ETHMAC_RES_NO_PACKET       - no such packet exists

  Example:
    <code>
    ethRes = DRV_ETHMAC_LibTxGetBufferStatus(pMacD, pTxBuff, NULL);
    if ( ethRes != DRV_ETHMAC_RES_OK )
    {
        // Handle packet not transmitted
    }
    </code>

  Remarks:
    The returned pointer to the packet status is invalid after the
    DRV_ETHMAC_LibTxAcknowledgeBuffer/DRV_ETHMAC_LibTxAcknowledgePacket is called.

    pBuff must be the pointer to the first buffer in the packet, if the packet spans
    multiple buffers.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthTxGetBufferStatus ( const void *pBuff, const DRV_ETHMAC_PKT_STAT_TX **pTxStat )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxGetBufferStatus (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, const DRV_ETHMAC_PKT_STAT_TX **pTxStat );




