aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxGetPacketStatus(DRV_ETHMAC_INSTANCE_DCPT* pMacD, const DRV_ETHMAC_PKT_DCPT* pPkt, const DRV_ETHMAC_PKT_STAT_TX** pTxStat)

  Summary:
    Provides the status of a transmitted packet.

  Description:
    This function provides the status of a transmitted packet.  The
    transmission of this packet has to have been completed otherwise the call
    will fail.

  Precondition:
    DRV_ETHMAC_LibTxSendPacket should have been called and the pPkt pointer must be valid.

  Parameters:
    pMacD       - driver instance.
    pPkt        - Packet whose status is being queried.

    pTxStat     - Address to store the pointer to the packet status or NULL if
                  status not needed

  Returns:
    DRV_ETHMAC_RES_OK              - the packet was transmitted OK,

    DRV_ETHMAC_RES_PACKET_QUEUED   - the packet is not done yet

    DRV_ETHMAC_RES_NO_PACKET       - no such packet exists

  Example:
    <code>
    ethRes = DRV_ETHMAC_LibTxGetPacketStatus(pMacD, pTxPacket, NULL);
    if ( ethRes != DRV_ETHMAC_RES_OK )
    {
        // Handle packet not transmitted
    }
    </code>

  Remarks:
    The returned pointer to the packet status is invalid after the
    DRV_ETHMAC_LibTxAcknowledgeBuffer/DRV_ETHMAC_LibTxAcknowledgePacket is called.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthTxGetPacketStatus(const DRV_ETHMAC_PKT_DCPT* pPkt, const DRV_ETHMAC_PKT_STAT_TX** pTxStat)</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxGetPacketStatus(DRV_ETHMAC_INSTANCE_DCPT* pMacD, const DRV_ETHMAC_PKT_DCPT* pPkt, const DRV_ETHMAC_PKT_STAT_TX** pTxStat);

// DOM-IGNORE-BEGIN
extern __inline__ DRV_ETHMAC_RESULT __attribute__((always_inline)) DRV_ETHMAC_LibTxGetPacketStatus(DRV_ETHMAC_INSTANCE_DCPT* pMacD, const DRV_ETHMAC_PKT_DCPT* pPkt, const DRV_ETHMAC_PKT_STAT_TX** pTxStat)
{
    return  DRV_ETHMAC_LibTxGetBufferStatus(pMacD, pPkt?pPkt->pBuff:0, pTxStat);
}
// DOM-IGNORE-END


// *****************************************************************************
// *****************************************************************************
// Section: packet acknowledge functions
// *****************************************************************************
// *****************************************************************************

/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxAcknowledgeBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )

  Summary:
    Acknowledges a transmitted buffer/packet

  Description:
    This function acknowledges a transmitted buffer/packet.  The transmission
    of this packet has to have been completed otherwise the call will fail.
    When pBuff==NULL, all currently transmitted packets will be acknowledged.
    The ackFnc, if !NULL, will be called for each buffer within the packet in
    turn.

  Precondition:
    DRV_ETHMAC_LibTxSendBuffer/DRV_ETHMAC_LibTxSendPacket should have been called.

  Parameters:
    pMacD       - driver instance.
    pBuff           - Buffer of the packet to be acknowledged or NULL.

    ackFnc          - Function to be called for the acknowledged buffers or
                      NULL

    fParam          - Parameter to be used in the ackFnc callback

  Returns:
    DRV_ETHMAC_RES_OK              - Success

    DRV_ETHMAC_RES_PACKET_QUEUED   - The packet is scheduled for transmission/
                              There are packets scheduled to be transmitted

    DRV_ETHMAC_RES_NO_PACKET       - No such packet exists in the transmit queue/
                              No packets scheduled for transmit

  Example:
    <code>
    ethRes=EthTxAcknowledgeBuffer(pTxBuff, myAckFnc, &myInstanceData);

    void myAckFnc(void* pBuff, int buffIx, void* param)
    {
        myInstanceType* pType=(myInstanceType*)param;
        // Handle each buffer acknowledgement
    }
    </code>

  Remarks:
    Any transmitted packet has to be acknowledged, otherwise the Ethernet library will
    run out of transmission descriptors.

    pBuff must be the pointer to the first buffer in the packet, if the packet
    spans multiple buffers.

    ackFnc is just a helper that allows the application to acknowledge the
    transmitted buffers without the need to maintain a list of buffers
    scheduled for transmission (this list is maintained by the Ethernet library
    anyway).

    Useful especially when the transmission result is not really needed and
    the function is called with pBuff=0.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthTxAcknowledgeBuffer ( const void *pBuff, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxAcknowledgeBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam );


/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxAcknowledgePacket(DRV_ETHMAC_INSTANCE_DCPT* pMacD, const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )

  Summary:
    Acknowledges a transmitted packet

  Description:
    This function acknowledges a transmitted packet.  The transmission
    of this packet has to have been completed otherwise the call will fail.
    When pPkt==NULL, all currently transmitted packets will be acknowledged.
    The ackFnc, if !NULL, will be called for each buffer within the packet in
    turn.

  Precondition:
    DRV_ETHMAC_LibTxSendPacket should have been called.

  Parameters:
    pMacD       - driver instance.
    pPkt            - Packet to be acknowledged or NULL.

    ackFnc          - Function to be called to acknowledge each buffer
                      within the packet or NULL

    fParam          - Parameter to be used in the ackFnc callback


  Returns:
    DRV_ETHMAC_RES_OK              - Success

    DRV_ETHMAC_RES_PACKET_QUEUED   - The packet is queued for transmission/
                              There are packets scheduled to be transmitted

    DRV_ETHMAC_RES_NO_PACKET       - No such packet exist sin th etransmit queue/
                              No packets scheduled for transmit

  Example:
    <code>
    ethRes=DRV_ETHMAC_LibTxAcknowledgePacket(pMacD, pTxPkt, 0, 0);
    </code>

