aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
  Remarks:
    Any transmitted packet has to be acknowledged, otherwise the Ethernet library will
    run out of transmission descriptors.

    ackFnc is just a helper that allows the application to acknowledge the
    transmitted buffers without the need to maintain a list of buffers
    scheduled for transmission (this list is maintained by the Ethernet library
    anyway).

    Useful especially when the transmission result is not really needed and
    the function is called with pPkt=0.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthTxAcknowledgePacket(const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxAcknowledgePacket(DRV_ETHMAC_INSTANCE_DCPT* pMacD, const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam );

// DOM-IGNORE-BEGIN
extern __inline__ DRV_ETHMAC_RESULT __attribute__((always_inline)) DRV_ETHMAC_LibTxAcknowledgePacket(DRV_ETHMAC_INSTANCE_DCPT* pMacD, const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )
{
    return  DRV_ETHMAC_LibTxAcknowledgeBuffer(pMacD, pPkt?pPkt->pBuff:0, ackFnc, fParam);
}
// DOM-IGNORE-END


/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxAcknowledgeBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )

  Summary:
    Acknowledges a received buffer/packet.

  Description:
    This function acknowledges a received buffer/packet.  The supplied packet
    has to have been previously received otherwise the call will fail.
    When pBuff==NULL, all currently received packets will be acknowledged.
    The ackFnc, if !NULL, will be called for each buffer within the packet in turn.

  Precondition:
    DRV_ETHMAC_LibRxSetBufferSize, DRV_ETHMAC_LibRxBuffersAppend, DRV_ETHMAC_LibRxGetPacket should have been
    called.

  Parameters:
    pMacD       - driver instance.
    pBuff       - Buffer/packet to be acknowledged or NULL

    ackFnc      - Function to be called for the acknowledged buffers or NULL

    fParam      - Parameter to be used in the ackFnc callback

  Returns:
    DRV_ETHMAC_RES_OK              - Success

    DRV_ETHMAC_RES_PACKET_QUEUED   - The packet is in the receiving queue/
                              There are packets in the receiving queue

    DRV_ETHMAC_RES_NO_PACKET       - No such packet in the receiving queue/
                              No packets available in the receiving queue

  Example:
    <code>
    ethRes = DRV_ETHMAC_LibRxAcknowledgeBuffer(pMacD, pRxBuff, myAckFnc, &myInstanceData);
    if ( ethRes != DRV_ETHMAC_RES_OK )
    {
        // Handle buffer not acknowledged
    }

    void myAckFnc(void* pBuff, int buffIx, void* param)
    {
        myInstanceType* pType=(myInstanceType*)param;
        // Handle each buffer acknowledgement
    }
    </code>

  Remarks:
    Any received packet has to be acknowledged, otherwise the Ethernet library will run
    out of descriptors.

    pBuff must be the pointer to the first buffer in the packet, if the packet
    spans multiple buffers.

    ackFnc is just a helper that allows the application to call an acknowledge
    function for each received buffer in turn.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthRxAcknowledgeBuffer ( const void *pBuff, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxAcknowledgeBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const void *pBuff, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam );


/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxAcknowledgePacket (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )

  Summary:
    Acknowledges a received packet.

  Description:
    This function acknowledges a received packet.  The supplied packet
    has to have been previously received otherwise the call will fail.
    When pPkt==NULL, all currently received packets will be acknowledged.
    The ackFnc, if !NULL, will be called for each buffer within the packet in turn.

  Precondition:
    DRV_ETHMAC_LibRxSetBufferSize, DRV_ETHMAC_LibRxBuffersAppend, DRV_ETHMAC_LibRxGetPacket should have been
    called.

  Parameters:
    pMacD       - driver instance.
    pPkt        - Packet to be acknowledged or NULL

    ackFnc      - Function to be called for the each buffer within the packet or NULL

    fParam      - Parameter to be used in the ackFnc callback

  Returns:
    DRV_ETHMAC_RES_OK              - Success

    DRV_ETHMAC_RES_PACKET_QUEUED   - The packet is in the receiving queue/
                              There are packets in the receiving queue

    DRV_ETHMAC_RES_NO_PACKET       - No such packet in the receiving queue/
                              No packets available in the receiving queue

  Example:
    <code>
    ethRes = DRV_ETHMAC_LibRxAcknowledgePacket(pMacD, pRxPkt, NULL, 0);
    if ( ethRes != DRV_ETHMAC_RES_OK )
    {
        // Handle packet not acknowledged
    }
    </code>

  Remarks:
    Any received packet has to be acknowledged, otherwise the Ethernet library will run
    out of descriptors.

    ackFnc is just a helper that allows the application to call an acknowledge
    function for each received buffer in turn.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthRxAcknowledgePacket ( const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxAcknowledgePacket (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam );

// DOM-IGNORE-BEGIN
extern __inline__ DRV_ETHMAC_RESULT __attribute__((always_inline)) DRV_ETHMAC_LibRxAcknowledgePacket(DRV_ETHMAC_INSTANCE_DCPT* pMacD, const DRV_ETHMAC_PKT_DCPT* pPkt, DRV_ETHMAC_BUFF_AckF ackFnc, void* fParam )
{
    return DRV_ETHMAC_LibRxAcknowledgeBuffer(pMacD, pPkt?pPkt->pBuff:0, ackFnc, fParam);
}
// DOM-IGNORE-END


// *****************************************************************************
// *****************************************************************************
// Section: Packet receive functions
// *****************************************************************************
// *****************************************************************************

