aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxGetBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  void **ppBuff, const DRV_ETHMAC_PKT_STAT_RX **pRxStat )

  Summary:
     Returns a pointer to the data and the status of the next available
     received packet.

  Description:
    This function returns a pointer to the data and the status of the next
    available received packet.  If there's no available fully received packet
    the call will fail (DRV_ETHMAC_RES_PACKET_QUEUED/DRV_ETHMAC_RES_NO_PACKET).  If the
    received packet spans multiple buffers/descriptors (i.e. when the size of
    the buffer, DRV_ETHMAC_LibRxSetBufferSize(DRV_ETHMAC_INSTANCE_DCPT* pMacD, ) is less than the packet size)
    DRV_ETHMAC_RES_RX_PKT_SPLIT_ERR will be returned.  However, if the ppBuff is NULL,
    then the caller can use the returned pRxStat to check the total size of the
    packet. Then using the size of the set buffers, the number of buffers used
    in the packet will result.

  Precondition:
    DRV_ETHMAC_LibRxSetBufferSize, DRV_ETHMAC_LibRxBuffersAppend should have been called.

  Parameters:
    pMacD       - driver instance.
    ppBuff          - Address of a pointer to packet buffer data or NULL

    pRxStat         - Address to store the pointer to the packet status or
                      NULL

  Returns:
    DRV_ETHMAC_RES_OK                  - For success

    DRV_ETHMAC_RES_PACKET_QUEUED       - The packet is in the reception queus/
                                  There are packets queued for receive but not
                                  completed yet

    DRV_ETHMAC_RES_NO_PACKET           - No such packet is in the receiving queue/
                                  No packets available in the receiving queue

    DRV_ETHMAC_RES_RX_PKT_SPLIT_ERR    - Packet spans accross multiple buffers

  Example:
    <code>
    // Wait to receive a packet
    do
    {
        ethRes = DRV_ETHMAC_LibRxGetBuffer(pMacD, &pBuff, &pRxPktStat);
    } while ( ethRes == DRV_ETHMAC_RES_PACKET_QUEUED );
    </code>

  Remarks:
    The returned status pointer is invalid once the DRV_ETHMAC_LibRxAcknowledgeBuffer/DRV_ETHMAC_LibRxAcknowledgePacket
    is called.

    Also the associated packet buffer if it was appended with a
    DRV_ETHMAC_BUFF_FLAG_RX_STICKY flag.

    The returned buffer, if existent, will be marked as reported only when the
    result returned is DRV_ETHMAC_RES_OK.

    In this case a new call to the function will not return the same buffer.

    If the call failed for some reason (result!=DRV_ETHMAC_RES_OK) the returned
    buffer is not marked as reported.

    A new call to this function will return the same buffer.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthRxGetBuffer ( void **ppBuff, const DRV_ETHMAC_PKT_STAT_RX **pRxStat )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxGetBuffer (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  void **ppBuff, const DRV_ETHMAC_PKT_STAT_RX **pRxStat );


/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxGetPacket (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  DRV_ETHMAC_PKT_DCPT *pPkt, int *pnBuffs,
                             const DRV_ETHMAC_PKT_STAT_RX **pRxStat )

  Summary:
    Provides the layout and the status of the next available received packet.

  Description:
    This function returns the layout and the status of the next available
    received packet.  If there's no available fully received packet the call
    will fail (DRV_ETHMAC_RES_PACKET_QUEUED/DRV_ETHMAC_RES_NO_PACKET).  The supplied pPkt has
    to be large enough to accommodate the packet layout in the case of packets
    split across multiple buffers/descriptors (i.e. when the size of the buffer,
    DRV_ETHMAC_LibRxSetBufferSize(DRV_ETHMAC_INSTANCE_DCPT* pMacD, ) is less than the packet size) otherwise
    DRV_ETHMAC_RES_RX_PKT_SPLIT_ERR will be returned.  However, if the pPkt is NULL,
    then the caller can use the returned pRxStat to check the total size of the
    packet. Then using the size of the set buffers, the number of buffers in
    pPkt will result.  pnBuffs can be used for the same purpose. If pnBuffs is
    supplied, the numbers of buffers in the packet will be returned.

  Precondition:
    DRV_ETHMAC_LibRxSetBufferSize, DRV_ETHMAC_LibRxBuffersAppend should have been called.

  Parameters:
    pMacD       - driver instance.
    pPkt            - Pointer to a packet descriptor: a list of buffer
                      descriptors large enough to receive the packet layout or
                      NULL.

    pnBuffs         - Pointer to store the number of buffers in the packet or
                      NULL.

    pRxStat         - Address to store the pointer to the packet status or
                      NULL.

  Returns:
    DRV_ETHMAC_RES_OK                  - For success.

    DRV_ETHMAC_RES_PACKET_QUEUED       - The packet is queued for reception/
                                  There are packets queued for receive but not
                                  completed yet.

    DRV_ETHMAC_RES_NO_PACKET           - No such packet in the receiving queue/
                                  No packets available in the receiving queue.

    DRV_ETHMAC_RES_RX_PKT_SPLIT_ERR    - Packet descriptor not large enough to store
                                  the whole packet.

  Example:
    <code>
    // Wait to receive a packet
    do
    {
        ethRes = DRV_ETHMAC_LibRxGetPacket(pMacD, &rxPktDcpt, &buffsPerRxPkt, &pRxPktStat);

    } while ( ethRes== DRV_ETHMAC_RES_PACKET_QUEUED );
    </code>

  Remarks:
    The packet list, when supplied, is terminated with a NULL buffer

    The returned status pointer is invalid after the DRV_ETHMAC_LibRxAcknowledgePacket(DRV_ETHMAC_INSTANCE_DCPT* pMacD, ) is
    called.  Also any buffers that were appended with a DRV_ETHMAC_BUFF_FLAG_RX_STICKY
    flag associated to the packet buffers.

    The returned packet, if existent, will be marked as reported only when the
    result returned is DRV_ETHMAC_RES_OK.  In this case a new call to the function
    will not return the same packet.

