aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_demos/firmware/src/config/curiosity2_pic32mzef_nvm/driver/ethmac/src/dynamic/drv_ethmac_lib.h
    If the call failed for some reason (result!=DRV_ETHMAC_RES_OK) the returned
    packet is not marked as reported.

    A new call to this function will return the same packet.
    <p>Replaces:<p><c><b>DRV_ETHMAC_RESULT EthRxGetPacket ( DRV_ETHMAC_PKT_DCPT *pPkt, int *pnBuffs, const DRV_ETHMAC_PKT_STAT_RX **pRxStat )</b></c>
 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxGetPacket (DRV_ETHMAC_INSTANCE_DCPT* pMacD,  DRV_ETHMAC_PKT_DCPT *pPkt, int *pnBuffs, const DRV_ETHMAC_PKT_STAT_RX **pRxStat );


// *****************************************************************************
// *****************************************************************************
// Section: Statistics and debug functions
// *****************************************************************************
// *****************************************************************************

/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxPendingBuffersGet(DRV_ETHMAC_INSTANCE_DCPT* pMacD, int* pnBuffs)

  Summary:
    Returns the number of pending RX buffers/descriptors in the driver's queues.

  Description:
    This function returns the number of pending RX buffers/descriptors in the driver's queues.
    If each incoming packet fits within a RX buffer (the RX buffer is large enough)
    than this corresponds to the number of pending RX packets.
    Otherwise the number of packets is less than the pending buffers.

  Precondition:
    DRV_ETHMAC_LibInit must have been called.
    DRV_ETHMAC_LibDescriptorsPoolAdd should have been called.
    DRV_ETHMAC_LibRxSetBufferSize, DRV_ETHMAC_LibRxBuffersAppend should have been called.

  Parameters:
    pMacD       - driver instance.
    pnBuffs     - pointer to an address to store the number of buffers

  Returns:
    DRV_ETHMAC_RES_OK  - the number of buffers was returned OK


  Example:
    <code>
    </code>

  Remarks:
    Info only, the number changes dynamically.

 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxPendingBuffersGet(DRV_ETHMAC_INSTANCE_DCPT* pMacD, int* pnBuffs);

/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxScheduledBuffersGet(DRV_ETHMAC_INSTANCE_DCPT* pMacD, int* pnBuffs)

  Summary:
    Returns the number of scheduled RX buffers/descriptors in the driver's queues.

  Description:
    This function returns the number of scheduled RX buffers/descriptors in the driver's queues.

  Precondition:
    DRV_ETHMAC_LibInit must have been called.
    DRV_ETHMAC_LibDescriptorsPoolAdd should have been called.
    DRV_ETHMAC_LibRxSetBufferSize, DRV_ETHMAC_LibRxBuffersAppend should have been called.

  Parameters:
    pMacD       - driver instance.
    pnBuffs     - pointer to an address to store the number of buffers

  Returns:
    DRV_ETHMAC_RES_OK  - the number of buffers was returned OK


  Example:
    <code>
    </code>

  Remarks:
    Info only, the number changes dynamically.

 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibRxScheduledBuffersGet(DRV_ETHMAC_INSTANCE_DCPT* pMacD, int* pnBuffs);

/*******************************************************************************
  Function:
    DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxPendingBuffersGet(DRV_ETHMAC_INSTANCE_DCPT* pMacD, int* pnBuffs)

  Summary:
    Returns the number of pending TX buffers/descriptors in the driver's queues.

  Description:
    This function returns the number of pending TX buffers/descriptors in the driver's queues.
    If each outgoing packet consists of only one TX RX buffer
    than this corresponds to the number of pending TX packets.
    Otherwise the number of TX packets is less than the pending buffers.

  Precondition:
    DRV_ETHMAC_LibInit must have been called.
    DRV_ETHMAC_LibDescriptorsPoolAdd should have been called.

  Parameters:
    pMacD       - driver instance.
    pnBuffs     - pointer to an address to store the number of buffers

  Returns:
    DRV_ETHMAC_RES_OK  - the number of buffers was returned OK

  Example:
    <code>
    </code>

  Remarks:
    Info only, the number changes dynamically.

 *****************************************************************************/

DRV_ETHMAC_RESULT DRV_ETHMAC_LibTxPendingBuffersGet(DRV_ETHMAC_INSTANCE_DCPT* pMacD, int* pnBuffs);



#endif  // _DRV_ETHMAC_LIB_H_

